wale/sampleSetup_WALE_r300/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2960;
        startFace       1048960;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2960;
        startFace       1051920;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       1054880;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4800;
        startFace       1059680;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          8880;
        startFace       1064480;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          8880;
        startFace       1073360;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
)

// ************************************************************************* //
